app/views/auctions/edit.html.erb

        <%= f.label :name, 'NOMBRE' %>
        <%= f.collection_select :name, Residence.all, :name , :name ,{}, class: 'form-control'%>
---
SELECT "residences".* FROM "residences"