app/views/auctions/new.html.erb

SELECT "residences".* FROM "residences"
---
        <%= f.label :name, 'NOMBRE' %>
        <%= f.collection_select :name, Residence.all, :name , :name ,{}, class: 'form-control'%>