app/views/auctions/show.html.erb

SELECT  "residences".* FROM "residences" WHERE "residences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <%if current_user.creditos > 0 %>
            <% @r = Residence.find(@auction.residence_id) %>