app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions"
---
	def index
		@auction = Auction.all

INSERT INTO "auctions" ("name", "monto", "minimapuja", "created_at", "updated_at", "residence_id", "user_id", "weekdate") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def create
		@auction = Auction.new(auction_params)
		@auction.user_id = 1
		if @auction.save

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
	def show
		@auction = Auction.find(params[:id])

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "reservations" ("user_id", "residence_id", "created_at", "updated_at", "modo", "weekdate") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["residence_id", 3], ["created_at", "2018-12-13 14:24:32.752885"], ["updated_at", "2018-12-13 14:24:32.752885"], ["modo", 1], ["weekdate", "2033-W33"]]
UPDATE "users" SET "creditos" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["creditos", 7], ["updated_at", "2018-12-13 14:32:41.890733"], ["id", 2]]
DELETE FROM "auctions" WHERE "auctions"."id" = $1  [["id", 8]]
---
	def destroy
		@auction = Auction.find(params[:id])
		if current_user.admin?
		  if @auction.user.creditos > 0
		  		@reservation = Reservation.new(residence: @auction.residence, user: @auction.user,  weekdate: @auction.weekdate, modo: "subasta")
				if @reservation.save
				   @auction.user.update(creditos: @auction.user.creditos - 1)
				   @auction.destroy

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
	def edit
		@auction = Auction.find(params[:id])

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "auctions" SET "user_id" = $1, "monto" = $2, "updated_at" = $3 WHERE "auctions"."id" = $4  [["user_id", 2], ["monto", 10], ["updated_at", "2018-12-13 13:26:58.745123"], ["id", 3]]
---
	def update
		@auction = Auction.find(params[:id])
		if @auction.update(auction_params)

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "auctions" SET "name" = $1, "updated_at" = $2 WHERE "auctions"."id" = $3  [["name", "finalizada"], ["updated_at", "2018-12-11 16:24:03.556591"], ["id", 5]]
---
	def finalizar
	    @auction = Auction.find(params[:id])
	    @auction.name = "finalizada"
	    @auction.save