app/controllers/hotsales_controller.rb

	def update
		@hotsale = Hotsale.find(params[:id])
		if @hotsale.update(params.require(:hotsale).permit(:weekdate, :residence_id, :price))
---
UPDATE "hotsales" SET "price" = $1, "updated_at" = $2 WHERE "hotsales"."id" = $3  [["price", 3336], ["updated_at", "2018-12-11 02:10:27.560471"], ["id", 1]]