app/controllers/hotsales_controller.rb

	def index
		@hotsale = Hotsale.all
---
SELECT "hotsales".* FROM "hotsales"

	def create
		@hotsale = Hotsale.new(params.require(:hotsale).permit(:weekdate, :residence_id, :price))
			if  ( Reservation.where(residence_id: @hotsale.residence_id, weekdate: @hotsale.weekdate).exists? or Auction.where(residence_id: @hotsale.residence_id, weekdate: @hotsale.weekdate).exists?)
				redirect_to hotsales_path, notice: 'No puede crear hotsale en esa fecha, ya esta reservada o en subasta'
			else
				if @hotsale.save
---
SELECT  "hotsales".* FROM "hotsales" WHERE "hotsales"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT  1 AS one FROM "reservations" WHERE (weekdate LIKE '%3%' AND residence_id LIKE '%2099-W50%' ) LIMIT $1  [["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE (residence_id LIKE '%3%' AND weekdate LIKE '%2099-W50%' )
INSERT INTO "hotsales" ("price", "created_at", "updated_at", "residence_id", "weekdate") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["price", 111], ["created_at", "2018-12-12 23:40:27.194399"], ["updated_at", "2018-12-12 23:40:27.194399"], ["residence_id", 3], ["weekdate", "2099-W50"]]

	def show
		@hotsale = Hotsale.find(params[:id])
---
SELECT  "hotsales".* FROM "hotsales" WHERE "hotsales"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

	def destroy
		@hotsale = Hotsale.find(params[:id])

		if current_user.present? && !current_user.admin?
			@reservation = Reservation.new(residence: @hotsale.residence, user: current_user,  weekdate: @hotsale.weekdate, modo: "hotsale")
			if @reservation.save
				redirect_to hotsales_path, notice: "Hotsale comprado exitosamente"
			else
				redirect_to hotsales_path, notice: "Hotsale terminado, alguien ya lo compro"	end
		end
		@hotsale.destroy
---
SELECT  "hotsales".* FROM "hotsales" WHERE "hotsales"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reservations" ("user_id", "residence_id", "created_at", "updated_at", "modo", "weekdate") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["residence_id", 2], ["created_at", "2018-12-13 01:51:39.840016"], ["updated_at", "2018-12-13 01:51:39.840016"], ["modo", 2], ["weekdate", "2025-W25"]]
DELETE FROM "hotsales" WHERE "hotsales"."id" = $1  [["id", 7]]

	def edit
		@hotsale = Hotsale.find(params[:id])
---
SELECT  "hotsales".* FROM "hotsales" WHERE "hotsales"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
		@hotsale = Hotsale.find(params[:id])

		if  (Reservation.where(residence_id: @hotsale.residence_id, weekdate: @hotsale.weekdate).exists? or Auction.where(residence_id: @hotsale.residence_id, weekdate: @hotsale.weekdate).exists?)
			redirect_to hotsales_path, notice: 'No puede crear hotsale en esa fecha, ya esta reservada o en subasta'
		else
			@hotsale.update(params.require(:hotsale).permit(:weekdate, :residence_id, :price))
---
SELECT  "hotsales".* FROM "hotsales" WHERE "hotsales"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "residences".* FROM "residences" WHERE "residences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "hotsales" SET "price" = $1, "updated_at" = $2 WHERE "hotsales"."id" = $3  [["price", 3336], ["updated_at", "2018-12-11 02:10:27.560471"], ["id", 1]]