app/controllers/reservations_controller.rb

def create
	@reservation = Reservation.new( reservation_params )
    @u = User.find(@reservation.user_id)
   if @reservation.modo == "hotsale"
		if @reservation.save
		  	redirect_to  home_index_path, notice: 'Reservaste la residencia exitosamente'
		else
			redirect_to  residences_path, notice: 'Fecha imposible de reservar, vuelva a intentar con otra'
		end
	else
		if @u.creditos > 0
		   if Hotsale.where(residence_id: @reservation.residence_id, weekdate: @reservation.weekdate).exists?
			  redirect_to  home_index_path, notice: 'Fecha en hotsale, no puede reservar'
		   else
				if  @reservation.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "reservations" ("user_id", "residence_id", "created_at", "updated_at", "startdate", "enddate") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 4], ["residence_id", 3], ["created_at", "2018-12-07 12:29:16.292730"], ["updated_at", "2018-12-07 12:29:16.292730"], ["startdate", "2018-12-25"], ["enddate", "2018-12-31"]]
UPDATE "users" SET "creditos" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["creditos", 1], ["updated_at", "2018-12-08 16:44:31.638174"], ["id", 5]]
SELECT  "residences".* FROM "residences" WHERE "residences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "reservations" WHERE "reservations"."weekdate" = $1 LIMIT $2  [["weekdate", "2018-W49"], ["LIMIT", 1]]
INSERT INTO "reservations" ("user_id", "residence_id", "created_at", "updated_at", "weekdate") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["residence_id", 2], ["created_at", "2018-12-11 15:52:31.765348"], ["updated_at", "2018-12-11 15:52:31.765348"], ["weekdate", "2027-W22"]]
UPDATE "users" SET "creditos" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["creditos", 98], ["updated_at", "2018-12-08 17:00:40.628601"], ["id", 6]]

def destroy
	reservation = Reservation.find(params[:id])
	if reservation.modo == "hotsale"
		if reservation.destroy
		  	redirect_to  home_index_path, notice: 'Cancelaste la reserva exitosamente'
		else
			redirect_to  home_index_path, notice: 'Reserva no fue cancelada'
		end
	else
		if reservation.destroy
			  	current_user.update(creditos: current_user.creditos + 1)
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 25]]
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 19]]
UPDATE "users" SET "creditos" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["creditos", 101], ["updated_at", "2018-12-09 23:19:32.714278"], ["id", 3]]