app/controllers/residences_controller.rb

	def index
  @residences = Residence.all
---
SELECT "residences".* FROM "residences"

	def create
		@residence = Residence.new(params.require(:residence).permit(:name, :des, :location, :pais, :provincia, :localidad))
		if @residence.save
---
INSERT INTO "residences" ("name", "des", "location", "created_at", "updated_at", "provincia", "localidad", "pais") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

	def show
		@residence = Residence.find(params[:id])
---
SELECT  "residences".* FROM "residences" WHERE "residences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def destroy
		residence = Residence.find(params[:id])
		if residence.destroy
---
SELECT  "residences".* FROM "residences" WHERE "residences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "residences" WHERE "residences"."id" = $1  [["id", 2]]

	def edit
		@residence = Residence.find(params[:id])
---
SELECT  "residences".* FROM "residences" WHERE "residences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]