app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
  def destroy
    @user = User.destroy(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "premium" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["premium", 1], ["updated_at", "2018-12-10 19:54:08.685385"], ["id", 5]]
---
  def apply_premium
    @user = User.find(params[:id])
    @user.premium = "solicitado"
    @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "premium" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["premium", 0], ["updated_at", "2018-12-10 19:54:21.702907"], ["id", 5]]
---
  def enable_premium
    @user = User.find(params[:id])
    @user.premium = "si"
    @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "creditos" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["creditos", 3], ["updated_at", "2018-12-11 15:07:31.677257"], ["id", 4]]
---
   def mascreditos
    @user = User.find(params[:id])
    @user.creditos = @user.creditos + 1
    @user.save