app/views/residences/show.html.erb


<%if Auction.exists?(residence_id: params[:id]) %>
---
SELECT  1 AS one FROM "auctions" WHERE "auctions"."residence_id" = $1 LIMIT $2  [["residence_id", 1], ["LIMIT", 1]]

  <p>
	<%if Hotsale.exists?(residence_id: params[:id]) %>
---
SELECT  1 AS one FROM "hotsales" WHERE "hotsales"."residence_id" = $1 LIMIT $2  [["residence_id", 1], ["LIMIT", 1]]