app/views/hotsales/index.html.erb

			<tr>
				<% @r = Residence.find(r.residence_id) %>
---
SELECT  "residences".* FROM "residences" WHERE "residences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]