app/views/hotsales/show.html.erb

SELECT  "residences".* FROM "residences" WHERE "residences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
			<tr>
				<% @r = Residence.find(@hotsale.residence_id) %>